Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/cap07-omegat.tmx
Source language: ca
Languages: es_es

source: Per rudimentari que siga un sistema de traducció automàtica, pot ser molt útil en tasques d'assimilació. Una de les aproximacions més simples a la TA és l'anomenada traducció mot per mot, en què el programa identifica cada mot, el busca en un diccionari bilingüe i el substitueix per una traducció aproximada. A tall d'exemple, considereu el següent text en tok pisin (el text està pres de {lyovin97b}): { Long taim bifo, wanpela ailan, draipela pik i save stap ya, na em i save kaikai ol man. Em i save kaikai ol man nau; wanpela taim, wanpela taim nau ol man go tokim bikpela man bilong ol, bos bilong ol, ol i go tokim em nau, em i tok: ``Orait yumi mas painim nupela ailan''. } Si prenem un diccionari i traduïm el text mot per mot, prenent la primera traducció possible en cada cas ---pot haver-n'hi més d'una---, s'obté el text següent: { En temps passat, un illa, enorme porc - soler viure esmentat i ell - soler menjar més-d'un home. Ell - soler menjar més-d'un home aleshores; un temps, un temps aleshores, més-d'un home anar parlar gran home en més-d'un, cap en més-d'un, més-d'un - anar parlar ell aleshores, ell - dir: ``Molt-bé, vosaltres-i-jo haver-de trobar nou illa''.} I ara, veritat que s'entén una miqueta més? La traducció idiomàtica correcta seria poc més o menys: { Fa molt temps, en una certa illa, vivia un gran porc i se solia menjar la gent. Se solia menjar la gent, i una vegada, la gent va anar i va dir al seu gran home, al seu cap, va anar i van parlar amb ell. Ell va dir: ``Molt bé, hem de trobar una nova illa''.} L'ordre dels mots no és molt diferent en tok pisin i en català i això fa que la traducció mot per mot siga prou llegidora. En canvi, si el text original està en basc, les coses no són tan senzilles. El text, pràcticament inintel·ligible per a qui no sàpia basc: { Bazkaria bukatu ondoren Koldo egunkarira joan zen eta Teoren foto bat hartu zuen. Gero, egunkariaren ale zaharrak irakurri zituen, boxeo txapelketako berriak aztertzeko. Boxealarien izenak apuntatu zituen.} es pot traduir mot per mot com: { El-dinar acabat després Koldo al-diari anat era i de-Teo foto una pres l'havia. Després, del-diari número els-vells llegit els-havia, boxa del-campionat les-notícies per-a-examinar. Dels-boxadors els noms apuntat els-havia.} que és molt més difícil de llegir que el resultat de traduir el text en tok pisin mot per mot. Una traducció idiomàtica possible és: { Després de dinar Koldo va anar al diari i va prendre una foto de Teo. Després, va llegir [els] números vells del diari per a examinar les notícies del campionat de boxa. Va apuntar els noms dels boxadors.} Fixeu-vos que fins i tot en aquest cas tan desfavorable el text traduït mot per mot dóna bastantes pistes sobre el significat del text original.
es_es: Por rudimentario que sea un sistema de traducción automática, puede ser muy útil en tareas de asimilación. Una de las aproximaciones más simples a la TA es la llamada traducción palabra por palabra, en que el programa identifica cada palabra, lo busca en un diccionario bilingüe y lo sustituye por una traducción aproximada. A guisa de ejemplo, considerad el siguiente texto en tok pisin (el texto está tomado de lyovin97b {}): { Long taim bifo, wanpela ailan, draipela pik y save stap ya, na me y save kaikai ol man. Me y save kaikai ol man nave; wanpela taim, wanpela taim nave ol man go tokim bikpela man bilong ol, bos bilong ol, ol y go tokim me nave, me y tok: ``Orait yumi cortijo painim nupela ailan''. } Si tomamos un diccionario y traducimos el texto palabra por palabra, tomando la primera traducción posible en cada caso ---puede haber más de una---, se obtiene el texto siguiente: { En tiempo pasado, un isla, enorme cerdo - soler vivir mencionado y él - soler comer más-de un hombre. Él - soler comer más-de un hombre entonces; un tiempo, un tiempo entonces, más-de un hombre ir hablar gran hombre en más-de uno, ninguno en más-de uno, más-de un - ir hablar él entonces, él - decir: ``Muy-bien, vosotros-y-yo haber-de encontrar nueva isla''.} Y ahora, ¿verdad que se entiende un poquito más? La traducción idiomática correcta sería poco más o menos: { Hace mucho tiempo, en una cierta isla, vivía un gran cerdo y se solía comer la gente. Se solía comer la gente, y una vez, la gente fue y dijo a su gran hombre, a su cabeza, fue y hablaron con él. Él dijo: ``Muy bien, tenemos que encontrar una nueva isla''.} La orden de las palabras no es muy diferente en tok pisin y en español, esto hace que la traducción palabra por palabra sea bastante legible. En cambio, si el texto original está en vasco, las cosas no son tan sencillas. El texto, prácticamente ininteligible para quien no sepa vasco: { Bazkaria bukatu ondoren Koldo egunkarira joan zen eta Teoren foto bate hartu zuen. Gero, egunkariaren ale zaharrak irakurri zituen, boxeo txapelketako berriak aztertzeko. Boxealarien izenak apuntatu zituen.} se puede traducir palabra por palabra cómo: { La-comida acabada después Koldo al-diario ido era y de-Teo foto una tomado lo había. Después, del-diario número los-viejos leído los-había, boxeo del-campeonato las-noticias por-a-examinar. De los-boxeadores los nombres apuntado los-había.} que es mucho más difícil de leer que el resultado de traducir el texto en tok pisin palabra por palabra. Una traducción idiomática posible es: { Después de comer Koldo fue al diario y tomó una foto de Teo. Después, leyó [los] números viejos del diario para examinar las noticias del campeonato de boxeo. Apuntó los nombres de los boxeadores.} Fijaos que incluso en este caso tan desfavorable el texto traducido palabra por palabra da bastantes pistas sobre el significado del texto original.

source: Si enviem un document HTML a un servidor de traducció automàtica i després posteditem el resultat perquè siga una traducció acceptable de l'original abans de publicar-la, estem usant la traducció automàtica{}
es_es: Si enviamos un documento HTML a un servidor de traducción automática y después posteditamos el resultado para que sea una traducción aceptable del original antes de publicarla, estamos usando la traducción automática{}

source: Per exemple, en anglés tècnic, el mot replace presenta una { ambigüitat lèxica
es_es: Por ejemplo, en inglés técnico, la palabra replace presenta una { ambigüedad léxica

source: SALT 3.0 tradueix textos de l'espanyol a la varietat valenciana del català i pregunta esporàdicament a la persona usuària quin equivalent és més adequat per a alguns mots ambigus difícils. Aquesta és una situació de{}
es_es: SALT 3.0 traduce textos del español a la variedad valenciana del catalán y pregunta esporádicamente a la persona usuaria qué equivalente es más adecuado para algunas palabras ambiguas difíciles. Esta es una situación de{}

source: d'assimilació d'informació de disseminació per al qual no està pensada Quina és l'alternativa estàndar a la preedició en un entorn de producció massiva de documentació multilingüe?
es_es: de asimilación de información de diseminación para el cual no está pensado ¿Cuál es la alternativa estándar a la preedición en un entorno de producción masiva de documentación multilingüe?

source: Usos de la traducció automàtica
es_es: Usos de la traducción automática

source: Un exemple de llenguatge controlat és l'anglés simplificat ({ Simplified English}) de l'AECMA (Associació Europea d'Indústries Aeroespacials), que es caracteritza per ``una sintaxi senzilla, un nombre limitat de mots, un nombre limitat de significats ben definits per mot (normalment un), i un nombre limitat de categories lèxiques) són conjunts de mots que tenen la mateixa funció sintàctica; hi ha categories majors, lèxiques o de classe oberta (substantiu, adjectiu, verb, etc.) que creixen quan s'afig nou lèxic a la llengua i categories menors, { gramaticals} o de classe tancada (articles, conjuncions, etc.), que no creixen i contenen mots amb funció gramatical. La sintaxi es defineix normalment, no en termes de mots, sinó en termes de categories lèxiques.} per mot (normalment una)'', amb ``l'objectiu de produir textos breus i no ambigus'' {AECMA07u}.
es_es: Un ejemplo de lenguaje controlado es el inglés simplificado ({ Simplified English}) del AECMA (Asociación Europea de Industrias Aeroespaciales), que se caracteriza por ``una sintaxis sencilla, un número limitado de palabras, un número limitado de significados muy definidos por palabra (normalmente uno), y un número limitado de categorías léxicas) son conjuntos de palabras que tienen la misma función sintáctica; hay categorías mayores, léxicas o de clase abierta (sustantivo, adjetivo, verbo, etc.) que crecen cuando se añade nuevo léxico a la lengua y categorías menores, { gramaticales} o de clase cerrada (artículos, conjunciones, etc.), que no crecen y contienen palabras con función gramatical. La sintaxis se define normalmente, no en términos de palabras, sino en términos de categorías léxicas.} por palabra (normalmente una)'', con ``el objetivo de producir textos breves y no ambiguos'' {AECMA07uno}.

source: Moltes situacions de traducció automàtica es poden classificar com a situacions de CAT, { computer-aided translation} o traducció assistida per ordinador, també anomenada traducció semiautomàtica. Però cal precisar millor què volem dir amb això d'``assistida per ordinador''. Ací són rellevants les nocions de MAHT (machine-aided human translation, traducció humana assistida per una màquina) i HAMT (human-aided machine translation, traducció automàtica assistida per un humà), que estableixen les dues situacions bàsiques d'interacció entre una persona i un ordinador a l'hora de fer la traducció. Els paràgrafs següents en donen alguns exemples.
es_es: Muchas situaciones de traducción automática se pueden clasificar como situaciones de CAT, { computer-aided translation} o traducción asistida por ordenador, también llamada traducción semiautomática. Pero hay que precisar mejor que queremos decir con esto de ``asistida por ordenador''. Aquí son relevantes las nociones de MAHT (machine-aided human translation, traducción humana asistida por una máquina) y HAMT (human-aided machine translation, traducción automática asistida por un humano), que establecen las dos situaciones básicas de interacción entre una persona y un ordenador a la hora de hacer la traducción. Los párrafos siguientes dan algunos ejemplos.

source: Quan la traducció automàtica s'usa per a la disseminació de documents tècnics de temàtica homogènia, pot ser interessant fer que els documents originals estiguen escrits usant un lèxic estàndard sense ambigüitats semàn­ti­ques i seguint unes regles sintàctiques i d'estil ben determinades, és a dir, en un llenguatge controlat {wojcik96u,arnold94b} dissenyat de manera que el resultat de la traducció automàtica puga ser usat directament per a publicar-lo amb el mínim possible de postedició.
es_es: Cuando la traducción automática se usa para la diseminación de documentos técnicos de temática homogénea, puede ser interesante hacer que los documentos originales estén escritos usando un léxico estándar sin ambigüedades semánticas y siguiendo unas reglas sintácticas y de estilo muy determinadas, es decir, en un lenguaje controlado {wojcik96uno,arnold94b} diseñado de forma que el resultado de la traducción automática pueda ser usado directamente para publicarlo con el mínimo posible de postedición.

source: Qüestions, exercicis i problemes
es_es: Cuestiones, ejercicios y problemas

source: La traducció automàtica instantània de pàgines web durant la navegació és un cas de traducció automàtica{}
es_es: La traducción automática instantánea de páginas web durante la navegación es un caso de traducción automática{}
